## SQL: Commands

<img src='https://drive.google.com/uc?id=1BihoAlxx2WOV74dIywWphTH_ggIvWVFh' height=500 width=800>

# DDL(Data Definition Language) Commands

### Create command

- create is a DDL SQL command used to create a table or a database in relational database management system.

### Creating a Database
- To create a database in RDBMS, create command is used. Following is the syntax:

CREATE DATABASE <DB_NAME>;

### Example for creating Database

In [ ]:
CREATE DATABASE Test;

### Creating a Table

- create command can also be used to create tables. Now when we create a table, we have to specify the details of the columns of the tables too. We can specify the names and datatypes of various columns in the create command itself.

#### Following is the syntax:

In [ ]:
CREATE TABLE <TABLE_NAME>
(
    column_name1 datatype1,
    column_name2 datatype2,
    column_name3 datatype3,
    column_name4 datatype4
);

#### Example for creating Table

In [ ]:
CREATE TABLE Student(
    student_id INT, 
    name VARCHAR(100), 
    age INT);

#### Most commonly used datatypes for Table columns

<img src='https://drive.google.com/uc?id=1RcXnlM9kDW7fAdYgmzRP0PHZgf_epi4s' height=500 width=800>

### SQL: ALTER command
- alter command is used for altering the table structure, such as,
    - to add a column to existing table
    - to rename any existing column
    - to change datatype of any column or to modify its size.
    - to drop a column from the table.

### ALTER Command: Add a new Column
- Using ALTER command we can add a column to any existing table. Following is the syntax,

ALTER TABLE table_name ADD(
    column_name datatype);

#### Here is an Example for this,

In [ ]:
ALTER TABLE student ADD(
    address VARCHAR(200)
);

### ALTER Command: Add multiple new Columns
- Using ALTER command we can even add multiple new columns to any existing table. Following is the syntax,

In [ ]:
ALTER TABLE table_name ADD(
    column_name1 datatype1, 
    column-name2 datatype2, 
    column-name3 datatype3);

#### Here is an Example for this,

In [ ]:
ALTER TABLE student ADD(
    father_name VARCHAR(60), 
    mother_name VARCHAR(60), 
    dob DATE);

### ALTER Command: Add Column with default value
- ALTER command can add a new column to an existing table with a default value too. The default value is used when no value is inserted in the column. Following is the syntax,

In [ ]:
ALTER TABLE table_name ADD(
    column-name1 datatype1 DEFAULT some_value
);

#### Here is an Example for this,

In [ ]:
ALTER TABLE student ADD(
    dob DATE DEFAULT '01-Jan-99'
);

### ALTER Command: Modify an existing Column
- ALTER command can also be used to modify data type of any existing column. Following is the syntax,

In [ ]:
ALTER TABLE table_name modify(
    column_name datatype
);

#### Here is an Example for this,

In [ ]:
ALTER TABLE student MODIFY(
    address varchar(300));

### ALTER Command: Rename a Column
- Using ALTER command you can rename an existing column. Following is the syntax,

In [ ]:
ALTER TABLE table_name RENAME 
    old_column_name TO new_column_name;

### Here is an example for this,

In [ ]:
ALTER TABLE student RENAME 
    address TO location;

### ALTER Command: Drop a Column
- ALTER command can also be used to drop or remove columns. Following is the syntax,

In [ ]:
ALTER TABLE table_name DROP(
    column_name);

#### Here is an example for this,

In [ ]:
ALTER TABLE student DROP(
    address);

### TRUNCATE command
- TRUNCATE command removes all the records from a table. But this command will not destroy the table's structure. When we use TRUNCATE command on a table its (auto-increment) primary key is also initialized. Following is its syntax,

In [ ]:
TRUNCATE TABLE table_name

#### Here is an example explaining it,

In [ ]:
TRUNCATE TABLE student;

### DROP command
- DROP command completely removes a table from the database. This command will also destroy the table structure and the data stored in it. Following is its syntax,

In [ ]:
DROP TABLE table_name

#### Here is an example explaining it,

In [ ]:
## Drop table
DROP TABLE student;

## Drop Databases
DROP DATABASE Test;

### RENAME command
- RENAME command is used to set a new name for any existing table. Following is the syntax,

In [ ]:
RENAME TABLE old_table_name to new_table_name

#### Here is an example explaining it.

RENAME TABLE student to students_info;

## DML(Data Manipulation Language) Command
 - Data Manipulation Language (DML) statements are used for managing data in database. DML commands are not auto-committed. It means changes made by DML command are not permanent to database, it can be rolled back.

- Talking about the Insert command, whenever we post a Tweet on Twitter, the text is stored in some table, and as we post a new tweet, a new record gets inserted in that table.

### INSERT command
- Insert command is used to insert data into a table. Following is its general syntax,

In [ ]:
INSERT INTO table_name VALUES(data1, data2, ...)

#### Here is an example:

In [ ]:
INSERT INTO address(addr_id,sid,house_no,street,area,land_marks,city,state,country,pincode) values(1,1001,'c-54','kana vihar','ayodhya nagar','behid ram mandir','jaipur','rajasthan','india',302021);

### UPDATE command
- UPDATE command is used to update any record of data in a table. Following is its general syntax,

In [ ]:
UPDATE table_name SET column_name = new_value WHERE some_condition;

<img src='https://drive.google.com/uc?id=1xJflKstTWgYs2agDDhHYFsvgQcfqM0zr' height=500 width=800>

In [ ]:
UPDATE student SET name='Abhi', age=17 where s_id=103;

### DELETE command
- DELETE command is used to delete data from a table.
Following is its general syntax,

In [ ]:
DELETE FROM table_name;

#### Here is an example:

In [ ]:
DELETE FROM student;

## TCL (Transaction Control Language) commands

### COMMIT command
- COMMIT command is used to permanently save any transaction into the database.

- When we use any DML command like INSERT, UPDATE or DELETE, the changes made by these commands are not permanent, until the current session is closed, the changes made by these commands can be rolled back.

- To avoid that, we use the COMMIT command to mark the changes as permanent.

Following is commit command's syntax:

In [ ]:
COMMIT;

### ROLLBACK command
- This command restores the database to last commited state. It is also used with SAVEPOINT command to jump to a savepoint in an ongoing transaction.

- If we have used the UPDATE command to make some changes into the database, and realise that those changes were not required, then we can use the ROLLBACK command to rollback those changes, if they were not commited using the COMMIT command.

Following is rollback command's syntax,

In [ ]:
ROLLBACK TO savepoint_name;

### SAVEPOINT command
- SAVEPOINT command is used to temporarily save a transaction so that you can rollback to that point whenever required.

Following is savepoint command's syntax,

In [ ]:
SAVEPOINT savepoint_name;

## DCL(Data Control Language) Command

- Data Control Language(DCL) is used to control privileges in Database. To perform any operation in the database, such as for creating tables, sequences or views, a user needs privileges. Privileges are of two types,

#### System:
- This includes permissions for creating session, table, etc and all types of other system privileges.

#### Object: 
- This includes permissions for any command or query to perform any operation on the database tables.

In DCL we have two commands,
#### GRANT: Used to provide any user access privileges or other priviliges for the database.
#### REVOKE: Used to take back permissions from any user.

##### Allow a User to create session

In [ ]:
GRANT CREATE SESSION TO username;

##### Allow a User to create table

In [ ]:
GRANT CREATE TABLE TO username;

##### Provide user with space on tablespace to store table

In [ ]:
ALTER USER username QUOTA UNLIMITED ON SYSTEM;

##### Grant all privilege to a User

In [ ]:
GRANT sysdba TO username

##### Grant permission to create any table

In [ ]:
GRANT CREATE ANY TABLE TO username

#### Grant permission to drop any table

In [ ]:
GRANT DROP ANY TABLE TO username

##### To take back Permissions

In [ ]:
REVOKE CREATE TABLE FROM username

## Using the WHERE SQL

#### Syntax for WHERE 
- Here is how you can use the WHERE clause with a DELETE statement, or any other statement,

In [ ]:
DELETE FROM table_name WHERE [condition];

<img src='https://drive.google.com/uc?id=1zy7Aj7kxwFs_iOMuXPhFaRAtQ2qOVOCe' height=500 width=800>

In [ ]:
SELECT s_id, 
    name, 
    age, 
    address 
    FROM student WHERE s_id = 101;

<img src='https://drive.google.com/uc?id=1hXCOdweP6lZ8b6I8ArERBJMXFp2eolx1' height=500 width=800>

### SQL LIKE 
- LIKE clause is used in the condition in SQL query with the WHERE clause. LIKE clause compares data with an expression using wildcard operators to match pattern given in the condition.

#### Wildcard operators
- There are two wildcard operators that are used in LIKE clause.

##### Percent sign %: represents zero, one or more than one character.
##### Underscore sign _: represents only a single character.

In [ ]:
### Example of LIKE clause

SELECT * FROM Student WHERE s_name LIKE 'A%';

#### Using _ and %

In [ ]:
SELECT * FROM Student WHERE s_name LIKE '_d%';

### SQL ORDER BY

<img src='https://drive.google.com/uc?id=1NJKrOBPIUKAh2F-t1ympvrbom6l37NXP' height=500 width=800>

#### Syntax of Order By

In [ ]:
SELECT column-list|* FROM table-name ORDER BY ASC | DESC;

##### Using default Order by

In [ ]:
SELECT * FROM Emp ORDER BY salary;

### Using Order by DESC

In [ ]:
SELECT * FROM Emp ORDER BY salary DESC;

### SQL Group By
- Group by clause is used to group the results of a SELECT query based on one or more columns. It is also used with SQL functions to group the result from one or more tables.
Syntax for using Group by in a statement.

In [ ]:
SELECT column_name, function(column_name)
FROM table_name 
WHERE condition 
GROUP BY column_name

#### Example of Group by in a Statement

In [ ]:
SELECT name, age 
FROM Emp GROUP BY salary

### Example of Group by in a Statement with WHERE clause

In [ ]:
SELECT name, salary 
FROM Emp 
WHERE age > 25
GROUP BY salary

### SQL HAVING
- - Having clause is used with SQL Queries to give more precise condition for a statement. It is used to mention condition in Group by based SQL queries, just like WHERE clause is used with SELECT query.
Syntax for HAVING clause is:

In [ ]:
SELECT column_name, function(column_name)
FROM table_name
WHERE column_name condition
GROUP BY column_name
HAVING function(column_name) condition

<img src='https://drive.google.com/uc?id=1edT5weJluejUzmtxJqabq2fP-gHs5ItS' height=500 width=800>

#### Example of SQL Statement using HAVING

In [ ]:
SELECT *
FROM sale GROUP BY customer
HAVING sum(previous_balance) > 3000

In [ ]:
### Do it YourSelf
# Ques:
    Which statement makes changes to the database’s global attributes?

# Options
    a) CHANGE
    b) ALTER
    c) ALTERNATE
    d) UPDATE

In [ ]:
# Ques:
    Which statement is used to see the definition for an existing database?

# Options
    a) SHOW CREATE DATABASE
    b) SHOW DATABASE
    c) SHOW CREATE
    d) SHOW CREATE DATABASE TABLE

In [ ]:
# Ques:
    Which keyword is used to create a database?
    
# Options
    a) CREATE
    b) SET
    c) SETUP
    d) LINK

In [ ]:
# Ques:
    What options did ALTER DATABASE statement add?
    
# Options
    a) DATABASE SNAPSHOT syntax
    b) ATTACH_REBUILD_LOG clause
    c) DB_CHAINING option
    d) READ_COMMITTED_SNAPSHOT

In [ ]:
# Ques:
    Syntax for dropping a database snapshot named “Sushant” would be ____________

# Options   
    a) DROP DATABASE Sushant
    b) DROP DATABASE SNAP Sushant
    c) DROP SNAPSHOT Sushant
    d) None of the mentioned

In [ ]:
# Ques:
    The DROP DATABASE statement must run in ________ mode.

# Options   
    a) Autocommit
    b) Commit
    c) Readcommit
    d) None of the mentioned

In [ ]:
# Ques:
    Features provided by ALTER DATABASE statement do not include ____________

# Options   
    a) Deletes database
    b) Modifies file
    c) Changes the attributes of a database
    d) Changes the database collation

In [ ]:
# Ques:
    The statement to change the table name is __________

# Options   
    a) CHANGE
    b) CHANGENAME
    c) CHANGENM
    d) RENAME

In [ ]:
# Ques:
    What is the meaning of LIKE ‘%0%0%’?
    
# Options   
    a) Feature begins with two 0’s
    b) Feature ends with two 0’s
    c) Feature has more than two 0’s
    d) Feature has two 0’s in it, at any position

In [ ]:
SQL query to find the temperature in increasing order of all cities.
a) SELECT city FROM weather ORDER BY temperature
b) SELECT city, temperature FROM weather
c) SELECT city, temperature FROM weather ORDER BY temperature
d) SELECT city, temperature FROM weather ORDER BY city

### Do it yourself 
**Note: These Questions is related to Following table.**

EmployeeInfo Table:
<img src='https://drive.google.com/uc?id=10FtBP4pOMaK7_kl9akR9log_FmtACmUV' height=500 width=800> 

EmployeePosition Table:
<img src='https://drive.google.com/uc?id=1Znr5gOl332pe-CrD3QN8p26AK7zRcIX7' height=500 width=800>

In [ ]:
# Queries:   
Q1. Write a query to fetch the EmpFname from the EmployeeInfo table in upper case and use the ALIAS name as EmpName.
Q2. Write a query to fetch the number of employees working in the department ‘HR’.
Q3. Write q query to find all the employees whose salary is between 50000 to 100000.
Q4. Write a query to retrieve the EmpFname and EmpLname in a single column as “FullName”. The first name and the last name
must be separated with space.
Q5. Write a query find number of employees whose DOB is between 02/05/1970 to 31/12/1975 and are grouped according to 
gender.
Q6. Write a query to fetch the department-wise count of employees sorted by department’s count in ascending order.
Q7. Write a query to retrieve two minimum and maximum salaries from the EmployeePosition table.
Q8. Write a query to retrieve the list of employees working in the same department.
Q9. Write a query to retrieve the last 3 records from the EmployeeInfo table.
Q10. Write a query to display the first and the last record from the EmployeeInfo table.

In [ ]:
### All MCQ Ans : Line by line
b, b, a, c, a, a, a, d, d, d